import { Checkbox } from 'antd'
import { CheckboxChangeEvent } from 'antd/es/checkbox'
import { useState } from 'react'
import { useNavigate } from 'react-router'

const ConsentForm = () => {
  const navigate = useNavigate()
  const [Check, setCheck] = useState<boolean>(false)

  return (
    <>
      <div className="xl:bg-[url(/LoginPage/LoginPageBg.webp)] md:bg-[url(/LoginPage/LoginPageIpadBg.webp)] w-full h-screen bg-no-repeat bg-cover bg-center bg-[url(/LoginPage/LoginPageMobileBg.webp)]">
        <div className="flex flex-col h-full w-auto items-center justify-center">
          <div className=" bg-[#9ddef9]/10 sm:w-2/3 md:w-5/6 lg:w-1/2 w-4/5 h-3/4 flex flex-col items-center justify-center rounded-3xl p-8 gap-y-6 mt-28">
            <p className=" text-white font-heading md:text-4xl text-3xl text-balance text-center">
              นโยบายข้อมูลส่วนบุคคล
            </p>
            <div className=" bg-white text-black w-full h-full overflow-y-scroll font-body p-3 space-y-2">
              <h2 className="text-xl">1. ข้อมูลสำคัญเกี่ยวกับโครงการ</h2>
              <ol className="pl-4 space-y-2">
                <li>
                  1. โครงการแข่งขันแก้ไขปัญหาด้วยการเขียนโปรแกรมคอมพิวเตอร์ ระดับมัธยมศึกษาตอนปลาย ปีการศึกษา 2567
                  ครyงที่ 2 หรือ Bangmod Hackathon 2024 ครั้งที่ 2 ซึ่งต่อจากนี้จะเรียกว่า &quot;โครงการ&quot;
                  ดำเนินการโดยคณะทำงานโครงการ ซึ่งต่อจากนี้จะเรียกว่า “คณะทำงาน”
                </li>
                <li>
                  2. คณะทำงานเป็นผู้ให้บริการเว็บไซต์ https://www.bangmodhackathon.com และเว็บไซต์ที่เกี่ยวข้อง
                  ซึ่งต่อจากนี้จะเรียกรวมว่า &quot;เว็บไซต์&quot;
                </li>
                <li>
                  3. ใช้งานเว็บไซต์ ซึ่งต่อจากนี้จะเรียกว่า &quot;ท่าน&quot; หรือ &quot;คุณ&quot;
                  เป็นบุคคลหรือผู้แทนที่มีสิทธิในการยินยอมให้ข้อมูลส่วนบุคคลของบุคคลทั้งหมด
                </li>
                <li>
                  4. เนื่องด้วยโครงการได้เห็นความสำคัญของการรักษาข้อมูลส่วนบุคคลของผู้ใช้
                  จึงได้กำหนดนโยบายความเป็นส่วนตัวนี้ขึ้น เพื่อกำหนดความมุ่งมั่นของโครงการต่อความเป็นส่วนตัวของผู้ใช้งาน
                  รวมถึงชี้แจงให้ทราบเกี่ยวกับกระบวนวิธีการ การเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลในโครงการ
                  ดังนั้นกรุณาอ่านนโยบายความเป็นส่วนตัวนี้โดยละเอียด โดยเมื่อเข้าใช้งานเว็บไซต์ของโครงการ
                  และยอมรับนโยบายที่เกี่ยวข้องนี้ อย่างชัดเจน
                  จะถือว่าท่านรับทราบและยอมรับข้อกำหนดนโยบายข้อมูลส่วนบุคคลนี้แล้ว หากท่านไม่ยอมรับนโยบายข้อมูลส่วนบุคคล
                  ท่านจะไม่สามารถทำการสมัครผ่านเว็บไซต์ของโครงการได้
                </li>
              </ol>
              <h2 className="text-xl">
                2. ข้อมูลส่วนบุคคล หรือ ข้อความส่วนบุคคลที่โครงการเก็บรวบรวมเกี่ยวกับผู้ใช้
                ซึ่งเป็นข้อมูลที่ทำให้สามารถระบุตัวตนของท่านได้ อาจทำการเก็บรวบรวม ใช้
                และถ่ายโอนข้อมูลส่วนบุคคลประเภทต่าง ๆ ที่เกี่ยวกับผู้ใช้ตามที่โครงการได้จัดกลุ่มไว้ด้วยกัน ดังต่อไปนี้
              </h2>
              <ol className="pl-4 space-y-2">
                <li>
                  1. อมูลส่วนตัวของสมาชิกภายในทีม ได้แก่ ชื่อ นามสกุล ชื่อเล่น เบอร์โทรศัพท์ รูปถ่าย
                  สำเนาบัตรประชาชนของท่าน เบอร์โทรติดต่อฉุกเฉิน ช่องทางติดต่อ และอีเมลเพื่อใช้สำหรับการติดต่อ
                  รวมไปถึงอาหาร/ยาที่แพ้และโรคประจำตัว
                </li>
                <li>
                  2. ข้อมูลส่วนตัวของอาจารย์ที่ปรึกษา ได้แก่ ชื่อ นามสกุล เบอร์โทรศัพท์ สำเนาบัตรประชาชนของท่าน
                  ช่องทางติดต่อ หนังสือยืนยันสถานภาพเป็นอาจารย์ประจำสถาบันการศึกษา และอีเมลเพื่อใช้สำหรับการติดต่อ
                  รวมไปถึงอาหาร/ยาที่แพ้และโรคประจำตัว
                </li>
                <li>
                  3. ข้อมูลการศึกษา ได้แก่ ใบรับรองผลการศึกษา (ปพ.7) ระดับการศึกษา หลักสูตร ชื่อสถานศึกษาและจังหวัด
                </li>
              </ol>
              <h2 className="text-xl">
                โครงการอาจเก็บรวบรวมข้อมูลเกี่ยวกับผู้ใช้หลายวิธี ได้แก่ การเก็บข้อมูลปฏิสัมพันธ์โดยตรง
                การกรอกแบบฟอร์มบนเว็บไซต์รับสมัครของโครงการ เพื่อทำการสมัครเข้าร่วมโครงการ เป็นต้น
              </h2>
              <ol className="pl-4 space-y-2">
                <li>
                  1. เทคโนโลยีอัตโนมัติหรือปฏิสัมพันธ์ ในขณะที่ท่านโต้ตอบกับเว็บไซต์ของโครงการ
                  ระบบเทคโนโลยีอัตโนมัติโครงการใช้งานบนเว็บไซต์อาจรวบรวมข้อมูลทางเทคนิค เช่น
                  ข้อมูลเกี่ยวกับเบราว์เซอร์ของท่านโดยอัตโนมัติ
                  ว่าท่านเข้าเยี่ยมชมพื้นที่ใดบนเว็บไซต์ของโครงการและลิงก์ที่ท่านคลิกดูเหตุการณ์
                  ช่วยให้โครงการสามารถส่งมอบประสบการณ์ที่ดีแก่ท่านเมื่อท่านเข้าชมเว็บไซต์ของโครงการ
                  และยังช่วยให้โครงการสามารถปรับปรุงพัฒนาเว็บไซต์ให้ดียิ่งขึ้น
                </li>
                <li>
                  2. บุคคลที่สาม หรือ แหล่งข้อมูลสาธารณะ
                  โครงการจะเก็บข้อมูลของผู้ใช้ผ่านการเข้าสู่ระบบโดยใช้สื่อสังคมออนไลน์
                  ทำให้โครงการอาจเก็บรวบรวมข้อมูลการติดต่อ อัตลักษณ์ และข้อมูลทางเทคนิค รวมไปถึง ชื่อผู้ใช้งาน
                  รูปประจำตัวผู้ใช้งาน และ อีเมล
                  ข้อมูลเกี่ยวกับสื่อสังคมออนไลน์ที่ท่านยินยอมเปิดเผยกับโครงการจะไปรวมกับข้อมูลที่ผู้ใช้ให้กับโครงการไว้
                  หรือที่โครงการรวบรวมไว้เกี่ยวกับท่าน
                </li>
              </ol>
              <h2 className="text-xl">
                4. วัตถุประสงค์ของการใช้ข้อมูลส่วนบุคคล โครงการมีวัตถุประสงค์ในการใช้ข้อมูล ดังต่อไปนี้
              </h2>
              <ol className="pl-4 space-y-2">
                <li>1. โครงการใช้ข้อมูลส่วนบุคคลเพื่อยืนยันคุณสมบัติและคัดเลือกผู้เข้าร่วมโครงการ</li>
                <li>2. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดกิจกรรมในโครงการ</li>
                <li>3. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดทำใบประกาศนียบัตรสำหรับผู้ที่เข้าร่วมโครงการ</li>
                <li>4. โครงการใช้ข้อมูลส่วนบุคคลเพื่อให้สามารถติดต่อผู้ดูแลได้ในกรณีฉุกเฉิน</li>
                <li>
                  5. โครงการใช้ข้อมูลแบบไม่ระบุตัวตน และข้อมูลเทคโนโลยีอัตโนมัติเพื่อใช้ในการวิเคราะห์ข้อมูลทางสถิติ
                </li>
              </ol>
              <h2 className="text-xl">5. สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล</h2>
              <ol className="pl-4 space-y-2">
                <li>
                  ท่านสามารถใช้สิทธิที่ท่านมีอยู่ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล อันรวมถึงการเข้าถึง การแก้ไข การลบ
                  และระงับการประมวลผลข้อมูลส่วนบุคคล โดยติดต่อผ่านทางผู้ดูแลข้อมูลของโครงการ ได้ที่อีเมล
                  bangmodhackathon.kmutt@gmail.com
                </li>
              </ol>
            </div>
            <div className=" w-full">
              <Checkbox
                className="text-white font-normal select-none"
                onChange={(e: CheckboxChangeEvent) => {
                  setCheck(e.target.checked)
                }}
              >
                ยินยอมข้อตกลงนโยบายข้อมูลส่วนบุคคล
              </Checkbox>
            </div>
            <div className="w-full">
              <button
                disabled={!Check}
                onClick={() => {
                  navigate('/register')
                }}
                className="w-full bg-primary_yellow-100 font-body rounded-md py-2 text-primary-200 hover:bg-primary_yellow-300 hover:text-primary-300 duration-200 disabled:cursor-not-allowed disabled:rounded-[5px] disabled:bg-[#FFF0BF] disabled:px-4 disabled:py-2 disabled:text-[#A5A6A7]"
              >
                ยืนยัน
              </button>
            </div>
          </div>
        </div>
      </div>
    </>
  )
}

export default ConsentForm
